eclipse-threadx/getting-started/SiliconLabs/EFR32MG12/lib/gecko_sdk_3.0.0_efr32mg12/platform/emlib/inc/em_adc.h
  /** ADC and reference selected for scan mode kept at warmup allowing
      continuous conversion. */
  adcWarmupKeepADCWarm     = _ADC_CTRL_WARMUPMODE_KEEPADCWARM,
} ADC_Warmup_TypeDef;

#if defined(_ADC_CTRL_ADCCLKMODE_MASK)
/** ADC EM2 clock configuration. */
typedef enum {
  adcEm2Disabled           = 0,
  adcEm2ClockOnDemand      = ADC_CTRL_ADCCLKMODE_ASYNC | ADC_CTRL_ASYNCCLKEN_ASNEEDED,
  adcEm2ClockAlwaysOn      = ADC_CTRL_ADCCLKMODE_ASYNC | ADC_CTRL_ASYNCCLKEN_ALWAYSON,
} ADC_EM2ClockConfig_TypeDef;
#endif

/*******************************************************************************
 *******************************   STRUCTS   ***********************************
 ******************************************************************************/

/** ADC initialization structure, common for single conversion and scan sequence. */
typedef struct {
  /**
   * Oversampling rate select. To have any effect, oversampling must
   * be enabled for single/scan mode.
   */
  ADC_OvsRateSel_TypeDef        ovsRateSel;

#if defined(_ADC_CTRL_LPFMODE_MASK)
  /** Lowpass or decoupling capacitor filter. */
  ADC_LPFilter_TypeDef          lpfMode;
#endif

  /** ADC Warm-up mode. */
  ADC_Warmup_TypeDef            warmUpMode;

  /**
   * Timebase for ADC warm up. Select N to give (N+1) HFPERCLK / HFPERCCLK cycles.
   * (Additional delay is added for bandgap references. See the
   * reference manual for more information.) Normally, N should be selected so that the timebase
   * is at least 1 us. See ADC_TimebaseCalc() to obtain
   * a suggested timebase of, at least, 1 us.
   */
  uint8_t                       timebase;

  /** Clock division factor N, ADC clock = (HFPERCLK or HFPERCCLK) / (N + 1). */
  uint8_t                       prescale;

  /** Enable/disable conversion tailgating. */
  bool                          tailgate;

  /** ADC EM2 clock configuration */
#if defined(_ADC_CTRL_ADCCLKMODE_MASK)
  ADC_EM2ClockConfig_TypeDef    em2ClockConfig;
#endif
} ADC_Init_TypeDef;

/** Default configuration for ADC initialization structure. */
#if defined(_ADC_CTRL_LPFMODE_MASK) && (!defined(_ADC_CTRL_ADCCLKMODE_MASK))
#define ADC_INIT_DEFAULT                                                   \
  {                                                                        \
    adcOvsRateSel2,              /* 2x oversampling (if enabled). */       \
    adcLPFilterBypass,           /* No input filter selected. */           \
    adcWarmupNormal,             /* ADC shutdown after each conversion. */ \
    _ADC_CTRL_TIMEBASE_DEFAULT,  /* Use hardware default value. */         \
    _ADC_CTRL_PRESC_DEFAULT,     /* Use hardware default value. */         \
    false                        /* Do not use tailgate. */                \
  }
#elif (!defined(_ADC_CTRL_LPFMODE_MASK)) && (!defined(_ADC_CTRL_ADCCLKMODE_MASK))
#define ADC_INIT_DEFAULT                                                   \
  {                                                                        \
    adcOvsRateSel2,              /* 2x oversampling (if enabled). */       \
    adcWarmupNormal,             /* ADC shutdown after each conversion. */ \
    _ADC_CTRL_TIMEBASE_DEFAULT,  /* Use hardware default value. */         \
    _ADC_CTRL_PRESC_DEFAULT,     /* Use hardware default value. */         \
    false                        /* Do not use tailgate. */                \
  }
#elif (!defined(_ADC_CTRL_LPFMODE_MASK)) && defined(_ADC_CTRL_ADCCLKMODE_MASK)
#define ADC_INIT_DEFAULT                                                   \
  {                                                                        \
    adcOvsRateSel2,              /* 2x oversampling (if enabled). */       \
    adcWarmupNormal,             /* ADC shutdown after each conversion. */ \
    _ADC_CTRL_TIMEBASE_DEFAULT,  /* Use hardware default value. */         \
    _ADC_CTRL_PRESC_DEFAULT,     /* Use hardware default value. */         \
    false,                       /* Do not use tailgate. */                \
    adcEm2Disabled               /* ADC disabled in EM2. */                \
  }
#endif

/** Scan input configuration. */
typedef struct {
  /** Input range select to be applied to ADC_SCANINPUTSEL. */
  uint32_t            scanInputSel;

  /** Input enable mask. */
  uint32_t            scanInputEn;

  /** Alternative negative input. */
  uint32_t            scanNegSel;
} ADC_InitScanInput_TypeDef;

/** Scan sequence initialization structure. */
typedef struct {
  /**
   * Peripheral reflex system trigger selection. Only applicable if @p prsEnable
   * is enabled.
   */
  ADC_PRSSEL_TypeDef  prsSel;

  /** Acquisition time (in ADC clock cycles). */
  ADC_AcqTime_TypeDef acqTime;

  /**
   * Sample reference selection. Note that, for external references, the
   * ADC calibration register must be set explicitly.
   */
  ADC_Ref_TypeDef     reference;

  /** Sample resolution. */
  ADC_Res_TypeDef     resolution;

#if defined(_ADC_SCANCTRL_INPUTMASK_MASK)
  /**
   * Scan input selection. If single ended (@p diff is false), use logical
   * combination of ADC_SCANCTRL_INPUTMASK_CHx defines. If differential input
   * (@p diff is true), use logical combination of ADC_SCANCTRL_INPUTMASK_CHxCHy
   * defines. (Notice underscore prefix for defines used.)
   */
  uint32_t            input;
#endif

#if defined(_ADC_SCANINPUTSEL_MASK)
  /**
   * Scan input configuration. Use @ref ADC_ScanInputClear(), @ref ADC_ScanSingleEndedInputAdd()
   * or @ref ADC_ScanDifferentialInputAdd() to update this structure.
   */
  ADC_InitScanInput_TypeDef scanInputConfig;
#endif

  /** Select if single-ended or differential input. */
  bool                diff;

  /** Peripheral reflex system trigger enable. */
  bool                prsEnable;

  /** Select if left adjustment should be done. */
  bool                leftAdjust;

  /** Select if continuous conversion until explicit stop. */
  bool                rep;

  /** When true, DMA is available in EM2 for scan conversion */
#if defined(_ADC_CTRL_SCANDMAWU_MASK)
  bool                scanDmaEm2Wu;
#endif

